pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
//*****************************************************************************
//
// Copyright (C) 2012 - 2015 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//  Redistributions of source code must retain the above copyright
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the
//  documentation and/or other materials provided with the
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//****************************************************************************


/************************************************************
* ADC
************************************************************/

#ifdef __MSP430_HAS_ADC__

#define ADCIV_ADCHIIFG          ADCIV__ADCHIIFG
#define ADCIV_ADCIFG            ADCIV__ADCIFG0
#define ADCIV_ADCINIFG          ADCIV__ADCINIFG
#define ADCIV_ADCLOIFG          ADCIV__ADCLOIFG
#define ADCIV_ADCOVIFG          ADCIV__ADCOVIFG
#define ADCIV_ADCTOVIFG         ADCIV__ADCTOVIFG
#define ADCIV_NONE              ADCIV__NONE

#endif

/************************************************************
* ADC12_B
************************************************************/
#ifdef __MSP430_HAS_ADC12_B__

#define ADC12_VECTOR         ADC12_B_VECTOR

#define ADC12IV_NONE         ADC12IV__NONE
#define ADC12IV_ADC12HIIFG   ADC12IV__ADC12HIIFG
#define ADC12IV_ADC12IFG0    ADC12IV__ADC12IFG0
#define ADC12IV_ADC12IFG1    ADC12IV__ADC12IFG1
#define ADC12IV_ADC12IFG2    ADC12IV__ADC12IFG2
#define ADC12IV_ADC12IFG3    ADC12IV__ADC12IFG3
#define ADC12IV_ADC12IFG4    ADC12IV__ADC12IFG4
#define ADC12IV_ADC12IFG5    ADC12IV__ADC12IFG5
#define ADC12IV_ADC12IFG6    ADC12IV__ADC12IFG6
#define ADC12IV_ADC12IFG7    ADC12IV__ADC12IFG7
#define ADC12IV_ADC12IFG8    ADC12IV__ADC12IFG8
#define ADC12IV_ADC12IFG9    ADC12IV__ADC12IFG9
#define ADC12IV_ADC12IFG10   ADC12IV__ADC12IFG10
#define ADC12IV_ADC12IFG11   ADC12IV__ADC12IFG11
#define ADC12IV_ADC12IFG12   ADC12IV__ADC12IFG12
#define ADC12IV_ADC12IFG13   ADC12IV__ADC12IFG13
#define ADC12IV_ADC12IFG14   ADC12IV__ADC12IFG14
#define ADC12IV_ADC12IFG15   ADC12IV__ADC12IFG15
#define ADC12IV_ADC12IFG16   ADC12IV__ADC12IFG16
#define ADC12IV_ADC12IFG17   ADC12IV__ADC12IFG17
#define ADC12IV_ADC12IFG18   ADC12IV__ADC12IFG18
#define ADC12IV_ADC12IFG19   ADC12IV__ADC12IFG19
#define ADC12IV_ADC12IFG20   ADC12IV__ADC12IFG20
#define ADC12IV_ADC12IFG21   ADC12IV__ADC12IFG21
#define ADC12IV_ADC12IFG22   ADC12IV__ADC12IFG22
#define ADC12IV_ADC12IFG23   ADC12IV__ADC12IFG23
#define ADC12IV_ADC12IFG24   ADC12IV__ADC12IFG24
#define ADC12IV_ADC12IFG25   ADC12IV__ADC12IFG25
#define ADC12IV_ADC12IFG26   ADC12IV__ADC12IFG26
#define ADC12IV_ADC12IFG27   ADC12IV__ADC12IFG27
#define ADC12IV_ADC12IFG28   ADC12IV__ADC12IFG28
#define ADC12IV_ADC12IFG29   ADC12IV__ADC12IFG29
#define ADC12IV_ADC12IFG30   ADC12IV__ADC12IFG30
#define ADC12IV_ADC12IFG31   ADC12IV__ADC12IFG31
#define ADC12IV_ADC12INIFG   ADC12IV__ADC12INIFG
#define ADC12IV_ADC12LOIFG   ADC12IV__ADC12LOIFG
#define ADC12IV_ADC12OVIFG   ADC12IV__ADC12OVIFG
#define ADC12IV_ADC12RDYIFG  ADC12IV__ADC12RDYIFG
#define ADC12IV_ADC12TOVIFG  ADC12IV__ADC12TOVIFG

#endif

/************************************************************
* CAP TOUCH
************************************************************/

#ifdef __MSP430_HAS_CAPTIO0__
#define __MSP430_HAS_CAP_TOUCH_IO_0__
#define CAP_TOUCH_0_BASE    CAPTIO0_BASE
#define __MSP430_BASEADDRESS_CAP_TOUCH_IO_0__ CAPTIO0_BASE
#define CAPSIO0CTL          CAPTIO0CTL
#endif
#ifdef __MSP430_HAS_CAPTIO1__
#define __MSP430_HAS_CAP_TOUCH_IO_1__
#define __MSP430_BASEADDRESS_CAP_TOUCH_IO_1__ CAPTIO1_BASE
#define CAP_TOUCH_1_BASE    CAPTIO1_BASE
#define CAPSIO1CTL          CAPTIO1CTL
#endif

#ifdef __MSP430_HAS_CAPTIOx__

#define CAPSIOPISEL0            CAPTIOPISEL0
#define CAPSIOPISEL1            CAPTIOPISEL1
#define CAPSIOPISEL2            CAPTIOPISEL2
#define CAPSIOPOSEL0            CAPTIOPOSEL0
#define CAPSIOPOSEL1            CAPTIOPOSEL1
#define CAPSIOPOSEL2            CAPTIOPOSEL2
#define CAPSIOPOSEL3            CAPTIOPOSEL3
#define CAPSIOEN                CAPTIOEN
#define CAPSIO                  CAPTIO

#endif

/************************************************************
* CLOCK SYSTEM
************************************************************/

#ifdef __MSP430_HAS_CS__

#ifdef __MSP430FR2XX_FR4XX_FAMILY__

#define DCOFTRIM_0              (0x0000)    /* DCO frequency trim: 0 */
#define DCOFTRIM_1              (0x0010)    /* DCO frequency trim: 1 */
#define DCOFTRIM_2              (0x0020)    /* DCO frequency trim: 2 */
#define DCOFTRIM_3              (0x0030)    /* DCO frequency trim: 3 */
#define DCOFTRIM_4              (0x0040)    /* DCO frequency trim: 4 */
#define DCOFTRIM_5              (0x0050)    /* DCO frequency trim: 5 */
#define DCOFTRIM_6              (0x0060)    /* DCO frequency trim: 6 */
#define DCOFTRIM_7              (0x0070)    /* DCO frequency trim: 7 */

#endif

