pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#ifdef __MSP430_HAS_DIO__

#ifdef __MSP430_HAS_PORT1_R__
#define P1IV_NONE       P1IV__NONE
#define P1IV_P1IFG0     P1IV__P1IFG0
#define P1IV_P1IFG1     P1IV__P1IFG1
#define P1IV_P1IFG2     P1IV__P1IFG2
#define P1IV_P1IFG3     P1IV__P1IFG3
#define P1IV_P1IFG4     P1IV__P1IFG4
#define P1IV_P1IFG5     P1IV__P1IFG5
#define P1IV_P1IFG6     P1IV__P1IFG6
#define P1IV_P1IFG7     P1IV__P1IFG7
#endif
#ifdef __MSP430_HAS_PORT2_R__
#define P2IV_NONE       P2IV__NONE
#define P2IV_P2IFG0     P2IV__P2IFG0
#define P2IV_P2IFG1     P2IV__P2IFG1
#define P2IV_P2IFG2     P2IV__P2IFG2
#define P2IV_P2IFG3     P2IV__P2IFG3
#define P2IV_P2IFG4     P2IV__P2IFG4
#define P2IV_P2IFG5     P2IV__P2IFG5
#define P2IV_P2IFG6     P2IV__P2IFG6
#define P2IV_P2IFG7     P2IV__P2IFG7
#endif
#ifdef __MSP430_HAS_PORT3_R__
#define P3IV_NONE       P3IV__NONE
#define P3IV_P3IFG0     P3IV__P3IFG0
#define P3IV_P3IFG1     P3IV__P3IFG1
#define P3IV_P3IFG2     P3IV__P3IFG2
#define P3IV_P3IFG3     P3IV__P3IFG3
#define P3IV_P3IFG4     P3IV__P3IFG4
#define P3IV_P3IFG5     P3IV__P3IFG5
#define P3IV_P3IFG6     P3IV__P3IFG6
#define P3IV_P3IFG7     P3IV__P3IFG7
#endif
#ifdef __MSP430_HAS_PORT4_R__
#define P4IV_NONE       P4IV__NONE
#define P4IV_P4IFG0     P4IV__P4IFG0
#define P4IV_P4IFG1     P4IV__P4IFG1
#define P4IV_P4IFG2     P4IV__P4IFG2
#define P4IV_P4IFG3     P4IV__P4IFG3
#define P4IV_P4IFG4     P4IV__P4IFG4
#define P4IV_P4IFG5     P4IV__P4IFG5
#define P4IV_P4IFG6     P4IV__P4IFG6
#define P4IV_P4IFG7     P4IV__P4IFG7
#endif
#ifdef __MSP430_HAS_PORT5_R__
#define P5IV_NONE       P5IV__NONE
#define P5IV_P5IFG0     P5IV__P5IFG0
#define P5IV_P5IFG1     P5IV__P5IFG1
#define P5IV_P5IFG2     P5IV__P5IFG2
#define P5IV_P5IFG3     P5IV__P5IFG3
#define P5IV_P5IFG4     P5IV__P5IFG4
#define P5IV_P5IFG5     P5IV__P5IFG5
#define P5IV_P5IFG6     P5IV__P5IFG6
#define P5IV_P5IFG7     P5IV__P5IFG7
#endif
#ifdef __MSP430_HAS_PORT6_R__
#define P6IV_NONE       P6IV__NONE
#define P6IV_P6IFG0     P6IV__P6IFG0
#define P6IV_P6IFG1     P6IV__P6IFG1
#define P6IV_P6IFG2     P6IV__P6IFG2
#define P6IV_P6IFG3     P6IV__P6IFG3
#define P6IV_P6IFG4     P6IV__P6IFG4
#define P6IV_P6IFG5     P6IV__P6IFG5
#define P6IV_P6IFG6     P6IV__P6IFG6
#define P6IV_P6IFG7     P6IV__P6IFG7
#endif
#ifdef __MSP430_HAS_PORT7_R__
#define P7IV_NONE       P7IV__NONE
#define P7IV_P7IFG0     P7IV__P7IFG0
#define P7IV_P7IFG1     P7IV__P7IFG1
#define P7IV_P7IFG2     P7IV__P7IFG2
#define P7IV_P7IFG3     P7IV__P7IFG3
#define P7IV_P7IFG4     P7IV__P7IFG4
#define P7IV_P7IFG5     P7IV__P7IFG5
#define P7IV_P7IFG6     P7IV__P7IFG6
#define P7IV_P7IFG7     P7IV__P7IFG7
#endif
#ifdef __MSP430_HAS_PORT8_R__
#define P8IV_NONE       P8IV__NONE
#define P8IV_P8IFG0     P8IV__P8IFG0
#define P8IV_P8IFG1     P8IV__P8IFG1
#define P8IV_P8IFG2     P8IV__P8IFG2
#define P8IV_P8IFG3     P8IV__P8IFG3
#define P8IV_P8IFG4     P8IV__P8IFG4
#define P8IV_P8IFG5     P8IV__P8IFG5
#define P8IV_P8IFG6     P8IV__P8IFG6
#define P8IV_P8IFG7     P8IV__P8IFG7
#endif
#endif

/************************************************************
* DMA
************************************************************/

#ifdef __MSP430_HAS_DMA__

#define __MSP430_HAS_DMAX_6__
#define __MSP430_BASEADDRESS_DMAX_6__ DMA_BASE
    
#define DMAIV_NONE              DMAIV__NONE
#define DMAIV_DMA0IFG           DMAIV__DMA0IFG
#define DMAIV_DMA1IFG           DMAIV__DMA1IFG
#define DMAIV_DMA2IFG           DMAIV__DMA2IFG
#define DMAIV_DMA3IFG           DMAIV__DMA3IFG
#define DMAIV_DMA4IFG           DMAIV__DMA4IFG
#define DMAIV_DMA5IFG           DMAIV__DMA5IFG

#define DMASBDB                 DMASRCBYTE | DMADSTBYTE
#define DMASBDW                 DMASRCBYTE
#define DMASWDB                 DMADSTBYTE
#define DMASWDW                 (0x0000)

#ifdef DMA0CTL
#define DMA0SAL                 DMA0SA_L
#define DMA0SAH                 DMA0SA_H
#define DMA0DAL                 DMA0DA_L
#define DMA0DAH                 DMA0DA_H
#endif
#ifdef DMA1CTL
#define DMA1SAL                 DMA1SA_L
#define DMA1SAH                 DMA1SA_H
#define DMA1DAL                 DMA1DA_L
#define DMA1DAH                 DMA1DA_H
#endif
#ifdef DMA2CTL
#define DMA2SAL                 DMA2SA_L
#define DMA2SAH                 DMA2SA_H
#define DMA2DAL                 DMA2DA_L
#define DMA2DAH                 DMA2DA_H
#endif

#endif

/************************************************************
* ECOMP0
************************************************************/

#ifdef __MSP430_HAS_ECOMP0__
#define ECOMP_BASE              ECOMP0_BASE

#ifdef CP0CTL0
#define CPCTL0                  CP0CTL0
#define CPCTL0_L                CP0CTL0_L
#define CPCTL0_H                CP0CTL0_H
#define OFS_CPCTL0              OFS_CP0CTL0
#define OFS_CPCTL0_L            OFS_CP0CTL0
#define OFS_CPCTL0_H            OFS_CP0CTL0+1
#endif
#ifdef CP0CTL1
#define CPCTL1                  CP0CTL1
#define CPCTL1_L                CP0CTL1_L
#define CPCTL1_H                CP0CTL1_H
#define OFS_CPCTL1              OFS_CP0CTL1
#define OFS_CPCTL1_L            OFS_CP0CTL1
#define OFS_CPCTL1_H            OFS_CP0CTL1+1
#endif
#ifdef CP0INT
#define CPINT                   CP0INT
#define CPINT_L                 CP0INT_L
#define CPINT_H                 CP0INT_H
#define OFS_CPINT               OFS_CP0INT
#define OFS_CPINT_L             OFS_CP0INT
#define OFS_CPINT_H             OFS_CP0INT+1
#endif
#ifdef CP0IV
#define CPIV                    CP0IV
#define CPIV_L                  CP0IV_L
#define CPIV_H                  CP0IV_H
#define OFS_CPIV                OFS_CP0IV
#define OFS_CPIV_L              OFS_CP0IV_L
#define OFS_CPIV_H              OFS_CP0IV+1
#endif
#ifdef CP0DACCTL
#define CPDACCTL                CP0DACCTL
#define CPDACCTL_L              CP0DACCTL_L
#define CPDACCTL_H              CP0DACCTL_H
#define OFS_CPDACCTL            OFS_CP0DACCTL
#define OFS_CPDACCTL_L          OFS_CP0DACCTL
#define OFS_CPDACCTL_H          OFS_CP0DACCTL+1
#endif
#ifdef CP0DACDATA
#define CPDACDATA               CP0DACDATA
#define CPDACDATA_L             CP0DACDATA_L
#define CPDACDATA_H             CP0DACDATA_H
#define OFS_CPDACDATA           OFS_CP0DACDATA
#define OFS_CPDACDATA_L         OFS_CP0DACDATA
#define OFS_CPDACDATA_H         OFS_CP0DACDATA+1
#endif

#endif

/************************************************************
* FRCTL
************************************************************/

