pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#ifdef __MSP430_HAS_FRCTL__

#define __MSP430_HAS_FRAM__
#define __MSP430_HAS_GC__
#define __MSP430_BASEADDRESS_FRAM__ FRCTL_BASE
#define FRAM_BASE               FRCTL_BASE
    
#define FWPW                    FRCTLPW
#define FRPW                    (0x9600)       /* FRAM password returned by read */
#define FXPW                    (0x3300)       /* for use with XOR instruction */

#endif

/************************************************************
* LCD_C
************************************************************/

#ifdef __MSP430_HAS_LCD_C__

#define OFS_LCDBM1              OFS_LCDM33_LCDBM1
#define OFS_LCDBM2              OFS_LCDM34_LCDBM2
#define OFS_LCDBM3              OFS_LCDM35_LCDBM3
#define OFS_LCDBM4              OFS_LCDM36_LCDBM4
#define OFS_LCDBM5              OFS_LCDM37_LCDBM5
#define OFS_LCDBM6              OFS_LCDM38_LCDBM6
#define OFS_LCDBM7              OFS_LCDM39_LCDBM7
#define OFS_LCDBM8              OFS_LCDM40_LCDBM8
#define OFS_LCDBM9              OFS_LCDM41_LCDBM9
#define OFS_LCDBM10             OFS_LCDM42_LCDBM10
#define OFS_LCDBM11             OFS_LCDM43_LCDBM11
#define OFS_LCDBM12             OFS_LCDM44_LCDBM12
#define OFS_LCDBM13             OFS_LCDM45_LCDBM13
#define OFS_LCDBM14             OFS_LCDM46_LCDBM14
#define OFS_LCDBM15             OFS_LCDM47_LCDBM15
#define OFS_LCDBM16             OFS_LCDM48_LCDBM16
#define OFS_LCDBM17             OFS_LCDM49_LCDBM17
#define OFS_LCDBM18             OFS_LCDM50_LCDBM18

#endif

/************************************************************
* LEA
************************************************************/

#ifdef __MSP430_HAS_LEA__

#define __MSP430_HAS_LEA_SC__
#define __MSP430_BASEADDRESS_LEA_SC__ LEA_BASE
#define LEA_SC_BASE LEA_BASE

#define LEASCCAP                LEACAP
#define LEASCCAPL               LEACAPL
#define LEASCCAPH               LEACAPH
#define LEASCCNF0               LEACNF0
#define LEASCCNF0L              LEACNF0L
#define LEASCCNF0H              LEACNF0H
#define LEASCCNF1               LEACNF1
#define LEASCCNF1L              LEACNF1L
#define LEASCCNF1H              LEACNF1H
#define LEASCCNF2               LEACNF2
#define LEASCCNF2L              LEACNF2L
#define LEASCCNF2H              LEACNF2H
#define LEASCMB                 LEAMB
#define LEASCMBL                LEAMBL
#define LEASCMBH                LEAMBH
#define LEASCMT                 LEAMT
#define LEASCMTL                LEAMTL
#define LEASCMTH                LEAMTH
#define LEASCCMA                LEACMA
#define LEASCCMAL               LEACMAL
#define LEASCCMAH               LEACMAH
#define LEASCCMCTL              LEACMCTL
#define LEASCCMCTLL             LEACMCTLL
#define LEASCCMCTLH             LEACMCTLH
#define LEASCCMDSTAT            LEACMDSTAT
#define LEASCCMDSTATL           LEACMDSTATL
#define LEASCCMDSTATH           LEACMDSTATH
#define LEASCS1STAT             LEAS1STAT
#define LEASCS1STATL            LEAS1STATL
#define LEASCS1STATH            LEAS1STATH
#define LEASCS0STAT             LEAS0STAT
#define LEASCS0STATL            LEAS0STATL
#define LEASCS0STATH            LEAS0STATH
#define LEASCDSTSTAT            LEADSTSTAT
#define LEASCDSTSTATL           LEADSTSTATL
#define LEASCDSTSTATH           LEADSTSTATH
#define LEASCPMCTL              LEAPMCTL
#define LEASCPMCTLL             LEAPMCTLL
#define LEASCPMCTLH             LEAPMCTLH
#define LEASCPMDST              LEAPMDST
#define LEASCPMDSTL             LEAPMDSTL
#define LEASCPMDSTH             LEAPMDSTH
#define LEASCPMS1               LEAPMS1
#define LEASCPMS1L              LEAPMS1L
#define LEASCPMS1H              LEAPMS1H
#define LEASCPMS0               LEAPMS0
#define LEASCPMS0L              LEAPMS0L
#define LEASCPMS0H              LEAPMS0H
#define LEASCPMCB               LEAPMCB
#define LEASCPMCBL              LEAPMCBL
#define LEASCPMCBH              LEAPMCBH
#define LEASCIFGSET             LEAIFGSET
#define LEASCIFGSETL            LEAIFGSETL
#define LEASCIFGSETH            LEAIFGSETH
#define LEASCIE                 LEAIE
#define LEASCIEL                LEAIEL
#define LEASCIEH                LEAIEH
#define LEASCIFG                LEAIFG
#define LEASCIFGL               LEAIFGL
#define LEASCIFGH               LEAIFGH
#define LEASCIV                 LEAIV
#define LEASCIVL                LEAIVL
#define LEASCIVH                LEAIVH

#define OFS_LEASCCAP            OFS_LEACAP
#define OFS_LEASCCAP_L          OFS_LEACAP_L
#define OFS_LEASCCAP_H          OFS_LEACAP_H
#define OFS_LEASCCNF0           OFS_LEACNF0
#define OFS_LEASCCNF0_L         OFS_LEACNF0_L
#define OFS_LEASCCNF0_H         OFS_LEACNF0_H
#define OFS_LEASCCNF1           OFS_LEACNF1
#define OFS_LEASCCNF1_L         OFS_LEACNF1_L
#define OFS_LEASCCNF1_H         OFS_LEACNF1_H
#define OFS_LEASCCNF2           OFS_LEACNF2
#define OFS_LEASCCNF2_L         OFS_LEACNF2_L
#define OFS_LEASCCNF2_H         OFS_LEACNF2_H
#define OFS_LEASCMB             OFS_LEAMB
#define OFS_LEASCMB_L           OFS_LEAMB_L
#define OFS_LEASCMB_H           OFS_LEAMB_H
#define OFS_LEASCMT             OFS_LEAMT
#define OFS_LEASCMT_L           OFS_LEAMT_L
#define OFS_LEASCMT_H           OFS_LEAMT_H
#define OFS_LEASCCMA            OFS_LEACMA
#define OFS_LEASCCMA_L          OFS_LEACMA_L
#define OFS_LEASCCMA_H          OFS_LEACMA_H
#define OFS_LEASCCMCTL          OFS_LEACMCTL
#define OFS_LEASCCMCTL_L        OFS_LEACMCTL_L
#define OFS_LEASCCMCTL_H        OFS_LEACMCTL_H
#define OFS_LEASCCMDSTAT        OFS_LEACMDSTAT
#define OFS_LEASCCMDSTAT_L      OFS_LEACMDSTAT_L
#define OFS_LEASCCMDSTAT_H      OFS_LEACMDSTAT_H
#define OFS_LEASCS1STAT         OFS_LEAS1STAT
#define OFS_LEASCS1STAT_L       OFS_LEAS1STAT_L
#define OFS_LEASCS1STAT_H       OFS_LEAS1STAT_H
#define OFS_LEASCS0STAT         OFS_LEAS0STAT
#define OFS_LEASCS0STAT_L       OFS_LEAS0STAT_L
#define OFS_LEASCS0STAT_H       OFS_LEAS0STAT_H
#define OFS_LEASCDSTSTAT        OFS_LEADSTSTAT
#define OFS_LEASCDSTSTAT_L      OFS_LEADSTSTAT_L
#define OFS_LEASCDSTSTAT_H      OFS_LEADSTSTAT_H
#define OFS_LEASCPMCTL          OFS_LEAPMCTL
#define OFS_LEASCPMCTL_L        OFS_LEAPMCTL_L
#define OFS_LEASCPMCTL_H        OFS_LEAPMCTL_H
#define OFS_LEASCPMDST          OFS_LEAPMDST
#define OFS_LEASCPMDST_L        OFS_LEAPMDST_L
#define OFS_LEASCPMDST_H        OFS_LEAPMDST_H
#define OFS_LEASCPMS1           OFS_LEAPMS1
#define OFS_LEASCPMS1_L         OFS_LEAPMS1_L
#define OFS_LEASCPMS1_H         OFS_LEAPMS1_H
#define OFS_LEASCPMS0           OFS_LEAPMS0
#define OFS_LEASCPMS0_L         OFS_LEAPMS0_L
#define OFS_LEASCPMS0_H         OFS_LEAPMS0_H
#define OFS_LEASCPMCB           OFS_LEAPMCB
#define OFS_LEASCPMCB_L         OFS_LEAPMCB_L
#define OFS_LEASCPMCB_H         OFS_LEAPMCB_H
#define OFS_LEASCIFGSET         OFS_LEAIFGSET
#define OFS_LEASCIFGSET_L       OFS_LEAIFGSET_L
#define OFS_LEASCIFGSET_H       OFS_LEAIFGSET_H
#define OFS_LEASCIE             OFS_LEAIE
#define OFS_LEASCIE_L           OFS_LEAIE_L
#define OFS_LEASCIE_H           OFS_LEAIE_H
#define OFS_LEASCIFG            OFS_LEAIFG
#define OFS_LEASCIFG_L          OFS_LEAIFG_L
#define OFS_LEASCIFG_H          OFS_LEAIFG_H
#define OFS_LEASCIV             OFS_LEAIV
#define OFS_LEASCIV_L           OFS_LEAIV_L
#define OFS_LEASCIV_H           OFS_LEAIV_H

