pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#define LEASCSWRST              LEASWRST
#define LEASCFTHOLD             LEAFTHOLD
#define LEASCFTHOLD_0           LEAFTHOLD_0
#define LEASCFTHOLD_1           LEAFTHOLD_1
#define LEASCLPR                LEALPR
#define LEASCLPR_0              LEALPR_0
#define LEASCLPR_1              LEALPR_1
#define LEASCILPM               LEAILPM
#define LEASCILPM_0             LEAILPM_0
#define LEASCILPM_1             LEAILPM_1
#define LEASCILB                LEAILB
#define LEASCTIMFLTE            LEATIMFLTE
#define LEASCTIMFLT_0           LEATIMFLT_0
#define LEASCTIMFLTE_1          LEATIMFLTE_1
#define LEASCCFLT               LEACFLT
#define LEASCCFLT_0             LEACFLT_0
#define LEASCCFLT_1             LEACFLT_1
#define LEASCMEMFLTE            LEAMEMFLTE
#define LEASCMEMFLTE_0          LEAMEMFLTE_0
#define LEASCMEMFLTE_1          LEAMEMFLTE_1
#define LEASCDONES              LEADONES
#define LEASCFREES              LEAFREES
#define LEASCTIMFLTS            LEATIMFLTS
#define LEASCCFLTS              LEACFLTS
#define LEASCCFLTS_0            LEACFLTS_0
#define LEASCCFLTS_1            LEACFLTS_1
#define LEASCMEMFLTS            LEAMEMFLTS
#define LEASCMEMFLTS_0          LEAMEMFLTS_0
#define LEASCMEMFLTS_1          LEAMEMFLTS_1
#define LEASCTRST               LEATRST
#define LEASCTEN                LEATEN
#define LEASCTISEL0             LEATISEL0
#define LEASCTISEL1             LEATISEL1
#define LEASCTISEL2             LEATISEL2
#define LEASCTISEL3             LEATISEL3
#define LEASCTISEL              LEATISEL
#define LEASCTISEL_0            LEATISEL_0
#define LEASCTISEL_1            LEATISEL_1
#define LEASCTISEL_2            LEATISEL_2
#define LEASCTISEL_3            LEATISEL_3
#define LEASCTISEL_4            LEATISEL_4
#define LEASCTISEL_5            LEATISEL_5
#define LEASCTISEL_6            LEATISEL_6
#define LEASCTISEL_7            LEATISEL_7
#define LEASCTISEL_8            LEATISEL_8
#define LEASCTISEL_9            LEATISEL_9
#define LEASCTISEL_10           LEATISEL_10
#define LEASCTISEL_11           LEATISEL_11
#define LEASCTISEL_12           LEATISEL_12
#define LEASCTISEL_13           LEATISEL_13
#define LEASCTISEL_14           LEATISEL_14
#define LEASCTISEL_15           LEATISEL_15

#define LEASCBUSY               LEABUSY
#define LEASCBUSY_0             LEABUSY_0
#define LEASCBUSY_1             LEABUSY_1
#define LEASCBUSY__READY        LEABUSY__READY
#define LEASCBUSY__BUSY         LEABUSY__BUSY
#define LEASCMODE               LEAMODE
#define LEASCMODE0              LEAMODE0
#define LEASCMODE1              LEAMODE1
#define LEASCMODE2              LEAMODE2
#define LEASCMODE3              LEAMODE3
#define LEASCMODE_0             LEAMODE_0
#define LEASCMODE_1             LEAMODE_1
#define LEASCMODE_2             LEAMODE_2
#define LEASCMODE_3             LEAMODE_3
#define LEASCMODE_4             LEAMODE_4
#define LEASCMODE_5             LEAMODE_5
#define LEASCMODE_6             LEAMODE_6
#define LEASCMODE_7             LEAMODE_7
#define LEASCMODE__OFF          LEAMODE__OFF
#define LEASCMODE__READY        LEAMODE__READY
#define LEASCMODE__RUNS         LEAMODE__RUNS
#define LEASCMODE__RUNR         LEAMODE__RUNR
#define LEASCMODE__RUNA         LEAMODE__RUNA
#define LEASCMODE__NOTIFY       LEAMODE__NOTIFY
#define LEASCMODE__SLEEP        LEAMODE__SLEEP
#define LEASCMODE__RUNL         LEAMODE__RUNL
#define LEASCPWST               LEAPWST
#define LEASCPWST0              LEAPWST0
#define LEASCPWST1              LEAPWST1
#define LEASCPWST2              LEAPWST2
#define LEASCPWST3              LEAPWST3
#define LEASCASST               LEAASST
#define LEASCASST0              LEAASST0
#define LEASCASST1              LEAASST1
#define LEASCASST2              LEAASST2
#define LEASCASST3              LEAASST3
#define LEASCDONEC              LEADONEC
#define LEASCFREEC              LEAFREEC
#define LEASCTIMFLTC            LEATIMFLTC
#define LEASCCFLTC              LEACFLTC
#define LEASCCFLTC_0            LEACFLTC_0
#define LEASCCFLTC_1            LEACFLTC_1
#define LEASCMEMFLTC            LEAMEMFLTC
#define LEASCMEMFLTC_0          LEAMEMFLTC_0
#define LEASCMEMFLTC_1          LEAMEMFLTC_1
#define LEASCRDSTAT             LEARDSTAT
#define LEASCRDSTAT0            LEARDSTAT0
#define LEASCRDSTAT1            LEARDSTAT1
#define LEASCRDSTAT2            LEARDSTAT2
#define LEASCRDSTAT3            LEARDSTAT3
#define LEASCWRSTAT             LEAWRSTAT
#define LEASCWRSTAT0            LEAWRSTAT0
#define LEASCWRSTAT1            LEAWRSTAT1
#define LEASCWRSTAT2            LEAWRSTAT2
#define LEASCWRSTAT3            LEAWRSTAT3

#define LEASCSPTR               LEASPTR
#define LEASCSPTR0              LEASPTR0
#define LEASCSPTR1              LEASPTR1
#define LEASCSPTR2              LEASPTR2
#define LEASCSPTR3              LEASPTR3
#define LEASCSPTR4              LEASPTR4
#define LEASCSPTR5              LEASPTR5
#define LEASCSPTR6              LEASPTR6
#define LEASCSPTR7              LEASPTR7
#define LEASCSPTR8              LEASPTR8
#define LEASCSPTR9              LEASPTR9
#define LEASCSPTR10             LEASPTR10
#define LEASCSPTR11             LEASPTR11
#define LEASCSPTR12             LEASPTR12
#define LEASCSPTR13             LEASPTR13
#define LEASCSPTR14             LEASPTR14
#define LEASCSPTR15             LEASPTR15

#define LEASCMB0                LEAMB0
#define LEASCMB1                LEAMB1
#define LEASCMB2                LEAMB2
#define LEASCMB3                LEAMB3
#define LEASCMB4                LEAMB4
#define LEASCMB5                LEAMB5
#define LEASCMB6                LEAMB6
#define LEASCMB7                LEAMB7
#define LEASCMB8                LEAMB8
#define LEASCMB9                LEAMB9
#define LEASCMB10               LEAMB10
#define LEASCMB11               LEAMB11
#define LEASCMB12               LEAMB12
#define LEASCMB13               LEAMB13
#define LEASCMB14               LEAMB14
#define LEASCMB15               LEAMB15

