pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#define LEASCMT0                LEAMT0
#define LEASCMT1                LEAMT1
#define LEASCMT2                LEAMT2
#define LEASCMT3                LEAMT3
#define LEASCMT4                LEAMT4
#define LEASCMT5                LEAMT5
#define LEASCMT6                LEAMT6
#define LEASCMT7                LEAMT7
#define LEASCMT8                LEAMT8
#define LEASCMT9                LEAMT9
#define LEASCMT10               LEAMT10
#define LEASCMT11               LEAMT11
#define LEASCMT12               LEAMT12
#define LEASCMT13               LEAMT13
#define LEASCMT14               LEAMT14
#define LEASCMT15               LEAMT15

#define LEASCCMDP               LEACMDP
#define LEASCCMDP0              LEACMDP0
#define LEASCCMDP1              LEACMDP1
#define LEASCCMDP2              LEACMDP2
#define LEASCCMDP3              LEACMDP3
#define LEASCCMDP4              LEACMDP4
#define LEASCCMDP5              LEACMDP5
#define LEASCCMDP6              LEACMDP6
#define LEASCCMDP7              LEACMDP7
#define LEASCCMDP8              LEACMDP8
#define LEASCCMDP9              LEACMDP9
#define LEASCCMDP10             LEACMDP10
#define LEASCCMDP11             LEACMDP11
#define LEASCCMDP12             LEACMDP12
#define LEASCCMDP13             LEACMDP13
#define LEASCCMDP14             LEACMDP14
#define LEASCCMDP15             LEACMDP15
#define LEASCCMDP16             LEACMDP16
#define LEASCCMDP17             LEACMDP17
#define LEASCCMDP18             LEACMDP18
#define LEASCCMDP19             LEACMDP19
#define LEASCCMDP20             LEACMDP20
#define LEASCCMDP21             LEACMDP21
#define LEASCCMDP22             LEACMDP22
#define LEASCCMDP23             LEACMDP23
#define LEASCCMDP24             LEACMDP24
#define LEASCCMDP25             LEACMDP25
#define LEASCCMDP26             LEACMDP26
#define LEASCCMDP27             LEACMDP27
#define LEASCCMDP28             LEACMDP28
#define LEASCCMDP29             LEACMDP29
#define LEASCCMDP30             LEACMDP30
#define LEASCCMDP31             LEACMDP31

#define LEASCCMAE               LEACMAE
#define LEASCCMAE_0             LEACMAE_0
#define LEASCCMAE_1             LEACMAE_1
#define LEASCINC                LEAINC
#define LEASCDEC                LEADEC
#define LEASCCROFF              LEACROFF
#define LEASCCROFF0             LEACROFF0
#define LEASCCROFF1             LEACROFF1
#define LEASCCROFF_0            LEACROFF_0
#define LEASCCROFF_1            LEACROFF_1
#define LEASCCROFF_2            LEACROFF_2
#define LEASCCROFF_3            LEACROFF_3

#define LEASCCRACTION           LEACRACTION
#define LEASCCMAP               LEACMAP
#define LEASCCMAP0              LEACMAP0
#define LEASCCMAP1              LEACMAP1
#define LEASCCMAP2              LEACMAP2
#define LEASCCMAP3              LEACMAP3
#define LEASCCMAP4              LEACMAP4
#define LEASCCMAP5              LEACMAP5
#define LEASCCMAP6              LEACMAP6
#define LEASCCMAP7              LEACMAP7
#define LEASCCMAP8              LEACMAP8
#define LEASCCMAP9              LEACMAP9
#define LEASCCMAP10             LEACMAP10
#define LEASCCMAP11             LEACMAP11
#define LEASCCMAP12             LEACMAP12
#define LEASCCMAP13             LEACMAP13
#define LEASCCMAP14             LEACMAP14
#define LEASCCMAP15             LEACMAP15

#define LEASCITFLG              LEAITFLG
#define LEASCITFLG0             LEAITFLG0
#define LEASCITFLG1             LEAITFLG1
#define LEASCITFLG_0            LEAITFLG_0
#define LEASCITFLG_1            LEAITFLG_1
#define LEASCITFLG_2            LEAITFLG_2
#define LEASCITFLG_3            LEAITFLG_3
#define LEASCCMD                LEACMD
#define LEASCCMD0               LEACMD0
#define LEASCCMD1               LEACMD1
#define LEASCCMD2               LEACMD2
#define LEASCCMD3               LEACMD3
#define LEASCCMD4               LEACMD4
#define LEASCCMD5               LEACMD5
#define LEASCCMD6               LEACMD6
#define LEASCCMD7               LEACMD7
#define LEASCCMD_0              LEACMD_0
#define LEASCCMD_2              LEACMD_2
#define LEASCCMD_4              LEACMD_4
#define LEASCCMD_6              LEACMD_6
#define LEASCCMD_8              LEACMD_8
#define LEASCCMD_10             LEACMD_10
#define LEASCCMD_12             LEACMD_12
#define LEASCCMD_13             LEACMD_13
#define LEASCCMD_15             LEACMD_15
#define LEASCCMD_16             LEACMD_16
#define LEASCCMD_17             LEACMD_17
#define LEASCCMD_18             LEACMD_18
#define LEASCCMD_19             LEACMD_19
#define LEASCCMD_21             LEACMD_21
#define LEASCCMD_22             LEACMD_22
#define LEASCCMD_23             LEACMD_23
#define LEASCCMD_24             LEACMD_24
#define LEASCCMD_25             LEACMD_25
#define LEASCCMD_26             LEACMD_26
#define LEASCCMD_27             LEACMD_27
#define LEASCCMD_28             LEACMD_28
#define LEASCCMD_29             LEACMD_29
#define LEASCCMD_30             LEACMD_30
#define LEASCCMD_31             LEACMD_31
#define LEASCCMD_32             LEACMD_32
#define LEASCCMD_33             LEACMD_33
#define LEASCCMD_34             LEACMD_34
#define LEASCCMD_36             LEACMD_36
#define LEASCCMD_39             LEACMD_39
#define LEASCCMD_41             LEACMD_41
#define LEASCCMD_43             LEACMD_43
#define LEASCCMD_45             LEACMD_45
#define LEASCCMD_47             LEACMD_47
#define LEASCCMD_48             LEACMD_48
#define LEASCCMD_50             LEACMD_50
#define LEASCCMD_52             LEACMD_52
#define LEASCCMD_53             LEACMD_53
#define LEASCCMD_54             LEACMD_54
#define LEASCCMD_55             LEACMD_55
#define LEASCCMD_56             LEACMD_56
#define LEASCCMD_58             LEACMD_58
#define LEASCCMD_59             LEACMD_59
#define LEASCCMD_64             LEACMD_64
#define LEASCCMD_65             LEACMD_65
#define LEASCCMD_66             LEACMD_66
#define LEASCCMD_67             LEACMD_67
#define LEASCCMD_68             LEACMD_68
#define LEASCCMD_69             LEACMD_69
#define LEASCCMD_70             LEACMD_70
#define LEASCCMD_71             LEACMD_71
#define LEASCCMD_73             LEACMD_73
#define LEASCCMD_75             LEACMD_75
#define LEASCCMD_76             LEACMD_76
#define LEASCCMD_77             LEACMD_77
#define LEASCCMD_78             LEACMD_78
#define LEASCCMD_79             LEACMD_79
#define LEASCCMD__SUSPEND                LEACMD__SUSPEND
#define LEASCCMD__RESUME                 LEACMD__RESUME
#define LEASCCMD__FFTCOMPLEXFIXEDSCALING LEACMD__FFTCOMPLEXFIXEDSCALING
#define LEASCCMD__FIR                    LEACMD__FIR
#define LEASCCMD__POLYNOMIAL             LEACMD__POLYNOMIAL
#define LEASCCMD__FFT                    LEACMD__FFT
#define LEASCCMD__POLYNOMIALLONG         LEACMD__POLYNOMIALLONG
#define LEASCCMD__MPYMATRIXROW           LEACMD__MPYMATRIXROW
#define LEASCCMD__MPYMATRIX              LEACMD__MPYMATRIX
#define LEASCCMD__ADDMATRIX              LEACMD__ADDMATRIX
#define LEASCCMD__MAXMATRIX              LEACMD__MAXMATRIX
#define LEASCCMD__MINMATRIX              LEACMD__MINMATRIX
#define LEASCCMD__IIRBQ1                 LEACMD__IIRBQ1
#define LEASCCMD__MAC                    LEACMD__MAC
#define LEASCCMD__DEINTERLEAVEEVENEVEN   LEACMD__DEINTERLEAVEEVENEVEN
#define LEASCCMD__DEINTERLEAVEEVENODD    LEACMD__DEINTERLEAVEEVENODD
#define LEASCCMD__DEINTERLEAVEODDEVEN    LEACMD__DEINTERLEAVEODDEVEN
#define LEASCCMD__DEINTERLEAVEODDODD     LEACMD__DEINTERLEAVEODDODD
#define LEASCCMD__MACCOMPLEXMATRIX       LEACMD__MACCOMPLEXMATRIX
#define LEASCCMD__MACCOMPLEXCONJUGATEMATRIX LEACMD__MACCOMPLEXCONJUGATEMATRIX
#define LEASCCMD__SUBMATRIX              LEACMD__SUBMATRIX
#define LEASCCMD__MPYLONGMATRIX          LEACMD__MPYLONGMATRIX
#define LEASCCMD__MPYCOMPLEXMATRIX       LEACMD__MPYCOMPLEXMATRIX
#define LEASCCMD__ADDLONGMATRIX          LEACMD__ADDLONGMATRIX
#define LEASCCMD__MOVELONGLIST           LEACMD__MOVELONGLIST
#define LEASCCMD__BITREVERSECOMPLEXEVEN  LEACMD__BITREVERSECOMPLEXEVEN
#define LEASCCMD__BITREVERSECOMPLEXODD   LEACMD__BITREVERSECOMPLEXODD
#define LEASCCMD__IIRBQ2EXTENDED         LEACMD__IIRBQ2EXTENDED
#define LEASCCMD__FFTCOMPLEXLONG         LEACMD__FFTCOMPLEXLONG
#define LEASCCMD__FFTLONG                LEACMD__FFTLONG
#define LEASCCMD__BITREVERSECOMPLEXLONGEVEN LEACMD__BITREVERSECOMPLEXLONGEVEN
#define LEASCCMD__BITREVERSECOMPLEXLONGODD LEACMD__BITREVERSECOMPLEXLONGODD
#define LEASCCMD__POLYNOMIALSCALAR       LEACMD__POLYNOMIALSCALAR
#define LEASCCMD__FFTCOMPLEXAUTOSCALING  LEACMD__FFTCOMPLEXAUTOSCALING
#define LEASCCMD__FIRLONG                LEACMD__FIRLONG
#define LEASCCMD__MACLONGMATRIX          LEACMD__MACLONGMATRIX
#define LEASCCMD__SUBLONGMATRIX          LEACMD__SUBLONGMATRIX
#define LEASCCMD__MAXLONGMATRIX          LEACMD__MAXLONGMATRIX
#define LEASCCMD__MINLONGMATRIX          LEACMD__MINLONGMATRIX
#define LEASCCMD__FIRCOMPLEX             LEACMD__FIRCOMPLEX
#define LEASCCMD__MAXUNSIGNEDMATRIX      LEACMD__MAXUNSIGNEDMATRIX
#define LEASCCMD__MINUNSIGNEDMATRIX      LEACMD__MINUNSIGNEDMATRIX
#define LEASCCMD__MACMATRIX              LEACMD__MACMATRIX
#define LEASCCMD__MAX                    LEACMD__MAX
#define LEASCCMD__MIN                    LEACMD__MIN
#define LEASCCMD__MAXUNSIGNED            LEACMD__MAXUNSIGNED
#define LEASCCMD__MINUNSIGNED            LEACMD__MINUNSIGNED
#define LEASCCMD__MAXUNSIGNEDLONGMATRIX  LEACMD__MAXUNSIGNEDLONGMATRIX
#define LEASCCMD__MINUNSIGNEDLONGMATRIX  LEACMD__MINUNSIGNEDLONGMATRIX
#define LEASCCMD__IIRBQ2                 LEACMD__IIRBQ2
#define LEASCCMD__FIRCOMPLEXLONG         LEACMD__FIRCOMPLEXLONG
#define LEASCCMD__DEINTERLEAVELONG       LEACMD__DEINTERLEAVELONG
#define LEASCCMD__WINDOW                 LEACMD__WINDOW
#define LEASCCMD__MAC3                   LEACMD__MAC3
#define LEASCCMD__SCALEDMAC              LEACMD__SCALEDMAC
#define LEASCCMD__SCALEDFIR              LEACMD__SCALEDFIR

#define LEASCS1VAL              LEAS1VAL
#define LEASCS1VAL0             LEAS1VAL0
#define LEASCS1VAL1             LEAS1VAL1
#define LEASCS1VAL2             LEAS1VAL2
#define LEASCS1VAL3             LEAS1VAL3
#define LEASCS1VAL4             LEAS1VAL4
#define LEASCS1VAL5             LEAS1VAL5
#define LEASCS1VAL6             LEAS1VAL6
#define LEASCS1VAL7             LEAS1VAL7
#define LEASCS1VAL8             LEAS1VAL8
#define LEASCS1VAL9             LEAS1VAL9
#define LEASCS1VAL10            LEAS1VAL10
#define LEASCS1VAL11            LEAS1VAL11
#define LEASCS1VAL12            LEAS1VAL12
#define LEASCS1VAL13            LEAS1VAL13
#define LEASCS1VAL14            LEAS1VAL14
#define LEASCS1VAL15            LEAS1VAL15
#define LEASCS1VAL16            LEAS1VAL16
#define LEASCS1VAL17            LEAS1VAL17
#define LEASCS1VAL18            LEAS1VAL18
#define LEASCS1VAL19            LEAS1VAL19
#define LEASCS1VAL20            LEAS1VAL20
#define LEASCS1VAL21            LEAS1VAL21
#define LEASCS1VAL22            LEAS1VAL22
#define LEASCS1VAL23            LEAS1VAL23
#define LEASCS1VAL24            LEAS1VAL24
#define LEASCS1VAL25            LEAS1VAL25
#define LEASCS1VAL26            LEAS1VAL26
#define LEASCS1VAL27            LEAS1VAL27
#define LEASCS1VAL28            LEAS1VAL28
#define LEASCS1VAL29            LEAS1VAL29
#define LEASCS1VAL30            LEAS1VAL30
#define LEASCS1VAL31            LEAS1VAL31

