pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#define LEASCS0VAL              LEAS0VAL
#define LEASCS0VAL0             LEAS0VAL0
#define LEASCS0VAL1             LEAS0VAL1
#define LEASCS0VAL2             LEAS0VAL2
#define LEASCS0VAL3             LEAS0VAL3
#define LEASCS0VAL4             LEAS0VAL4
#define LEASCS0VAL5             LEAS0VAL5
#define LEASCS0VAL6             LEAS0VAL6
#define LEASCS0VAL7             LEAS0VAL7
#define LEASCS0VAL8             LEAS0VAL8
#define LEASCS0VAL9             LEAS0VAL9
#define LEASCS0VAL10            LEAS0VAL10
#define LEASCS0VAL11            LEAS0VAL11
#define LEASCS0VAL12            LEAS0VAL12
#define LEASCS0VAL13            LEAS0VAL13
#define LEASCS0VAL14            LEAS0VAL14
#define LEASCS0VAL15            LEAS0VAL15
#define LEASCS0VAL16            LEAS0VAL16
#define LEASCS0VAL17            LEAS0VAL17
#define LEASCS0VAL18            LEAS0VAL18
#define LEASCS0VAL19            LEAS0VAL19
#define LEASCS0VAL20            LEAS0VAL20
#define LEASCS0VAL21            LEAS0VAL21
#define LEASCS0VAL22            LEAS0VAL22
#define LEASCS0VAL23            LEAS0VAL23
#define LEASCS0VAL24            LEAS0VAL24
#define LEASCS0VAL25            LEAS0VAL25
#define LEASCS0VAL26            LEAS0VAL26
#define LEASCS0VAL27            LEAS0VAL27
#define LEASCS0VAL28            LEAS0VAL28
#define LEASCS0VAL29            LEAS0VAL29
#define LEASCS0VAL30            LEAS0VAL30
#define LEASCS0VAL31            LEAS0VAL31

#define LEASCCMDEN              LEACMDEN
#define LEASCCMDEN_0            LEACMDEN_0
#define LEASCCMDEN_1            LEACMDEN_1
#define LEASCTRG                LEATRG

#define LEASCCTX                LEACTX
#define LEASCCTX0               LEACTX0
#define LEASCCTX1               LEACTX1
#define LEASCCTX2               LEACTX2
#define LEASCCTX3               LEACTX3
#define LEASCCTX4               LEACTX4
#define LEASCCTX5               LEACTX5
#define LEASCCTX6               LEACTX6
#define LEASCCTX7               LEACTX7
#define LEASCCTX8               LEACTX8
#define LEASCCTX9               LEACTX9
#define LEASCCTX10              LEACTX10
#define LEASCCTX11              LEACTX11

#define LEASCCOVLIS             LEACOVLIS
#define LEASCCOVLIS_0           LEACOVLIS_0
#define LEASCCOVLIS_1           LEACOVLIS_1
#define LEASCTIS                LEATIS
#define LEASCTIS_0              LEATIS_0
#define LEASCTIS_1              LEATIS_1
#define LEASCOORIS              LEAOORIS
#define LEASCOORIS_0            LEAOORIS_0
#define LEASCOORIS_1            LEAOORIS_1
#define LEASCSDIIS              LEASDIIS
#define LEASCSDIIS_0            LEASDIIS_0
#define LEASCSDIIS_1            LEASDIIS_1
#define LEASCPMCMDIS            LEAPMCMDIS
#define LEASCPMCMDIS_0          LEAPMCMDIS_0
#define LEASCPMCMDIS_1          LEAPMCMDIS_1

#define LEASCCOVLIE             LEACOVLIE
#define LEASCCOVLIE_0           LEACOVLIE_0
#define LEASCCOVLIE_1           LEACOVLIE_1
#define LEASCTIE                LEATIE
#define LEASCTIE_0              LEATIE_0
#define LEASCTIE_1              LEATIE_1
#define LEASCOORIE              LEAOORIE
#define LEASCOORIE_0            LEAOORIE_0
#define LEASCOORIE_1            LEAOORIE_1
#define LEASCSDIIE              LEASDIIE
#define LEASCSDIIE_0            LEASDIIE_0
#define LEASCSDIIE_1            LEASDIIE_1
#define LEASCPMCMDIE            LEAPMCMDIE
#define LEASCPMCMDIE_0          LEAPMCMDIE_0
#define LEASCPMCMDIE_1          LEAPMCMDIE_1

#define LEASCCOVLIFG            LEACOVLIFG
#define LEASCCOVLIFG_0          LEACOVLIFG_0
#define LEASCCOVLIFG_1          LEACOVLIFG_1
#define LEASCTIFG               LEATIFG
#define LEASCTIFG_0             LEATIFG_0
#define LEASCTIFG_1             LEATIFG_1
#define LEASCOORIFG             LEAOORIFG
#define LEASCOORIFG_0           LEAOORIFG_0
#define LEASCOORIFG_1           LEAOORIFG_1
#define LEASCSDIIFG             LEASDIIFG
#define LEASCSDIIFG_0           LEASDIIFG_0
#define LEASCSDIIFG_1           LEASDIIFG_1
#define LEASCPMCMDIFG           LEAPMCMDIFG
#define LEASCPMCMDIFG_0         LEAPMCMDIFG_0
#define LEASCPMCMDIFG_1         LEAPMCMDIFG_1

#define LEASCIV0                LEAIV0
#define LEASCIV1                LEAIV1
#define LEASCIV2                LEAIV2
#define LEASCIV3                LEAIV3
#define LEASCIV4                LEAIV4
#define LEASCIV5                LEAIV5
#define LEASCIV6                LEAIV6
#define LEASCIV7                LEAIV7
#define LEASCIV_0               LEAIV_0
#define LEASCIV_2               LEAIV_2
#define LEASCIV_4               LEAIV_4
#define LEASCIV_6               LEAIV_6
#define LEASCIV_8               LEAIV_8
#define LEASCIV_10              LEAIV_10
#define LEASCIV__NONE           LEAIV__NONE
#define LEASCIV__COVLIFG        LEAIV__COVLIFG
#define LEASCIV__TIFG           LEAIV__TIFG
#define LEASCIV__OORIFG         LEAIV__OORIFG
#define LEASCIV__SDIIFG         LEAIV__SDIIFG
#define LEASCIV__PMCMDIFG       LEAIV__PMCMDIFG

#ifdef LEA_VECTOR
#define LEA_SC_VECTOR           LEA_VECTOR
#endif

#endif

/************************************************************
* MPY32
************************************************************/

#ifdef __MSP430_HAS_MPY32__

#define OP1_32                  MPYOP1_32
#define OP1_32_L                MPYOP1_32_L
#define OP2_32                  MPYOP2_32
#define OP2_32_L                MPYOP1_32_L

#define MPY_B                   MPY_L
#define MPYS_B                  MPYS_L
#define MAC_B                   MAC_L
#define MACS_B                  MACS_L
#define OP2_B                   OP2_L
#define MPY32L_B                MPY32L_L
#define MPY32H_B                MPY32H_L
#define MPYS32L_B               MPYS32L_L
#define MPYS32H_B               MPYS32H_L
#define MAC32L_B                MAC32L_L
#define MAC32H_B                MAC32H_L
#define MACS32L_B               MACS32L_L
#define MACS32H_B               MACS32H_L
#define OP2L_B                  OP2L_L
#define OP2H_B                  OP2H_L

#endif

/************************************************************
* PMM
************************************************************/

#ifdef __MSP430_HAS_PMM__
#define __MSP430_HAS_PMM_FRAM__
#endif

/************************************************************
* RAMCTL
************************************************************/

#ifdef __MSP430_HAS_RAMCTL__
#define RAM_BASE                RAMCTL_BASE
#define __MSP430_BASEADDRESS_RC_FRAM__ RAMCTL_BASE
#define __MSP430_HAS_RC_FRAM__
#endif

/************************************************************
* RTC
************************************************************/

