pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#ifdef __MSP430_HAS_RTC__

#define RTCIV_NONE              RTCIV__NONE
#define RTCIV_RTCIF             RTCIV__RTCIFG

#define RTCIF                   RTCIFG
#define RTCIF_L                 RTCIFG_L

#endif

/************************************************************
* RTC_C
************************************************************/

#ifdef __MSP430_HAS_RTC_C__

#define RTCPWD                  RTCCTL0_H
#define RTCCTL1                 RTCCTL13_L
#define RTCCTL3                 RTCCTL13_H

#define RTC_VECTOR              RTC_C_VECTOR

#define RTC_NONE                RTCIV__NONE
#define RTC_RTCOFIFG            RTCIV__RTCOFIFG
#define RTC_RTCRDYIFG           RTCIV__RTCRDYIFG
#define RTC_RTCTEVIFG           RTCIV__RTCTEVIFG
#define RTC_RTCAIFG             RTCIV__RTCAIFG
#define RTC_RT0PSIFG            RTCIV__RT0PSIFG
#define RTC_RT1PSIFG            RTCIV__RT1PSIFG

#define RTCIV_NONE              RTCIV__NONE
#define RTCIV_RTCOFIFG          RTCIV__RTCOFIFG
#define RTCIV_RTCRDYIFG         RTCIV__RTCRDYIFG
#define RTCIV_RTCTEVIFG         RTCIV__RTCTEVIFG
#define RTCIV_RTCIF             RTCIV__RTCIFG
#define RTCIV_RTCAIFG           RTCIV__RTCAIFG
#define RTCIV_RT0PSIFG          RTCIV__RT0PSIFG
#define RTCIV_RT1PSIFG          RTCIV__RT1PSIFG

#define RTCCLKSEL               RTCCKSEL
#define RTCCLKSEL_H             RTCCKSEL_H

#define RTCAE                   (0x0080)

#define RTCSEC                  RTCTIM0_L
#define RTCMIN                  RTCTIM0_H
#define RTCHOUR                 RTCTIM1_L
#define RTCDOW                  RTCTIM1_H
#define RTCDAY                  RTCDATE_L
#define RTCMON                  RTCDATE_H
#define RTCYEARL                RTCYEAR_L
#define RT0PS                   RTCPS_L
#define RT1PS                   RTCPS_H
#define RTCAMIN                 RTCAMINHR_L
#define RTCAHOUR                RTCAMINHR_H
#define RTCADOW                 RTCADOWDAY_L
#define RTCADAY                 RTCADOWDAY_H

#endif

/************************************************************
* SYS
************************************************************/

#ifdef __MSP430_HAS_SYS__

#define SYSRSTIV_NONE           SYSRSTIV__NONE
#define SYSRSTIV_BOR            SYSRSTIV__BOR
#define SYSRSTIV_CSPW           SYSRSTIV__CSPW
#define SYSRSTIV_DOBOR          SYSRSTIV__PMMSWBOR
#define SYSRSTIV_DOPOR          SYSRSTIV__PMMSWPOR
#define SYSRSTIV_FLLUL          SYSRSTIV__FLLUL
#define SYSRSTIV_FRCTLPW        SYSRSTIV__FRCTLPW
#define SYSRSTIV_LPM5WU         SYSRSTIV__LPM5WU
#define SYSRSTIV_MPUPW          SYSRSTIV__MPUPW
#define SYSRSTIV_MPUSEG1IFG     SYSRSTIV__MPUSEG1IFG
#define SYSRSTIV_MPUSEG2IFG     SYSRSTIV__MPUSEG2IFG
#define SYSRSTIV_MPUSEG3IFG     SYSRSTIV__MPUSEG3IFG
#define SYSRSTIV_MPUSEGIIFG     SYSRSTIV__MPUSEGIIFG
#define SYSRSTIV_MPUSEGPIFG     SYSRSTIV__MPUSEGPIFG
#define SYSRSTIV_PERF           SYSRSTIV__PERF
#define SYSRSTIV_PMMPW          SYSRSTIV__PMMPW
#define SYSRSTIV_RSTNMI         SYSRSTIV__RSTNMI
#define SYSRSTIV_SECYV          SYSRSTIV__SECYV
#define SYSRSTIV_SVSHIFG        SYSRSTIV__SVSHIFG
#define SYSRSTIV_UBDIFG         SYSRSTIV__UBDIFG
#define SYSRSTIV_WDTKEY         SYSRSTIV__WDTPW
#define SYSRSTIV_WDTPW          SYSRSTIV__WDTPW
#define SYSRSTIV_WDTTO          SYSRSTIV__WDTIFG

#define SYSSNIV_NONE            SYSSNIV__NONE
#define SYSSNIV_ACCTEIFG        SYSSNIV__ACCTEIFG
#define SYSSNIV_CBDIFG          SYSSNIV__CBDIFG
#define SYSSNIV_JMBINIFG        SYSSNIV__JMBINIFG
#define SYSSNIV_JMBOUTIFG       SYSSNIV__JMBOUTIFG
#define SYSSNIV_LEASCCMD        SYSSNIV__LEACMD
#define SYSSNIV_LEASCTO         SYSSNIV__LEATO
#define SYSSNIV_MPUSEG1IFG      SYSSNIV__MPUSEG1IFG
#define SYSSNIV_MPUSEG2IFG      SYSSNIV__MPUSEG2IFG
#define SYSSNIV_MPUSEG3IFG      SYSSNIV__MPUSEG3IFG
#define SYSSNIV_MPUSEGIIFG      SYSSNIV__MPUSEGIIFG
#define SYSSNIV_MPUSEGPIFG      SYSSNIV__MPUSEGPIFG
#define SYSSNIV_SVSLIFG         SYSSNIV__SVSLIFG
#define SYSSNIV_UBDIFG          SYSSNIV__UBDIFG
#define SYSSNIV_VMAIFG          SYSSNIV__VMAIFG
#define SYSSNIV_WPROT           SYSSNIV__WPROT

#define SYSUNIV_NONE            SYSUNIV__NONE
#define SYSUNIV_NMIIFG          SYSUNIV__NMIIFG
#define SYSUNIV_OFIFG           SYSUNIV__OFIFG

#ifdef __MSP430_HAS_LEA__

#define SYSSNIV__LEASCTO        SYSSNIV__LEATO
#define SYSSNIV__LEASCTO_L      SYSSNIV__LEATO_L
#define SYSSNIV__LEASCCMD       SYSSNIV__LEACMD
#define SYSSNIV__LEASCCMD_L     SYSSNIV__LEACMD_L

#endif

#endif

/************************************************************
* Timer A
************************************************************/

#ifdef  __MSP430_HAS_TAx__            /* Definition to show that Module is available */
#define __MSP430_HAS_TxA7__

#define OFS_TAxCTL             OFS_TA0CTL
#define OFS_TAxCCTL0           OFS_TA0CCTL0
#define OFS_TAxCCTL1           OFS_TA0CCTL1
#define OFS_TAxCCTL2           OFS_TA0CCTL2
#define OFS_TAxCCTL3           OFS_TA0CCTL3
#define OFS_TAxCCTL4           OFS_TA0CCTL4
#define OFS_TAxCCTL5           OFS_TA0CCTL5
#define OFS_TAxCCTL6           OFS_TA0CCTL6
#define OFS_TAxR               OFS_TA0R
#define OFS_TAxCCR0            OFS_TA0CCR0
#define OFS_TAxCCR1            OFS_TA0CCR1
#define OFS_TAxCCR2            OFS_TA0CCR2
#define OFS_TAxCCR3            OFS_TA0CCR3
#define OFS_TAxCCR4            OFS_TA0CCR4
#define OFS_TAxCCR5            OFS_TA0CCR5
#define OFS_TAxCCR6            OFS_TA0CCR6
#define OFS_TAxIV              OFS_TA0IV
#define OFS_TAxEX0             OFS_TA0EX0

/* TAxIV Definitions */
#define TAxIV_NONE             (0x0000)       /* No Interrupt pending */
#define TAxIV_TACCR1           (0x0002)       /* TAxCCR1_CCIFG */
#define TAxIV_TACCR2           (0x0004)       /* TAxCCR2_CCIFG */
#define TAxIV_TACCR3           (0x0006)       /* TAxCCR3_CCIFG */
#define TAxIV_TACCR4           (0x0008)       /* TAxCCR4_CCIFG */
#define TAxIV_TACCR5           (0x000A)       /* TAxCCR5_CCIFG */
#define TAxIV_TACCR6           (0x000C)       /* TAxCCR6_CCIFG */
#define TAxIV_TAIFG            (0x000E)       /* TAxIFG */

