pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
/* Legacy Defines */
#define TAxIV_TAxCCR1          (0x0002)       /* TAxCCR1_CCIFG */
#define TAxIV_TAxCCR2          (0x0004)       /* TAxCCR2_CCIFG */
#define TAxIV_TAxCCR3          (0x0006)       /* TAxCCR3_CCIFG */
#define TAxIV_TAxCCR4          (0x0008)       /* TAxCCR4_CCIFG */
#define TAxIV_TAxCCR5          (0x000A)       /* TAxCCR5_CCIFG */
#define TAxIV_TAxCCR6          (0x000C)       /* TAxCCR6_CCIFG */
#define TAxIV_TAxIFG           (0x000E)       /* TAxIFG */

#ifndef MC__CONTINOUS
#define MC__CONTINOUS      MC__CONTINUOUS
#endif

#endif

#ifdef __MSP430_HAS_TA0__
#if (__MSP430_HAS_TA0__ == 3)
	#define __MSP430_BASEADDRESS_T0A3__ TA0_BASE
	#define __MSP430_HAS_T0A3__
#endif
#define TIMER_A0_BASE       TA0_BASE

#define TA0IV_TA0CCR1       TAIV__TACCR1
#define TA0IV_TA0CCR2       TAIV__TACCR2
#define TA0IV_TA0IFG        TAIV__TAIFG
#define TA0IV_NONE          TAIV__NONE
#define TA0IV_TACCR1        TAIV__TACCR1
#define TA0IV_TACCR2        TAIV__TACCR2
#define TA0IV_3             TAIV__TACCR3
#define TA0IV_4             TAIV__TACCR4
#define TA0IV_5             TAIV__TACCR5
#define TA0IV_6             TAIV__TACCR6
#define TA0IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA1__
#if (__MSP430_HAS_TA1__ == 3)
	#define __MSP430_BASEADDRESS_T1A3__ TA1_BASE
	#define __MSP430_HAS_T1A3__
#endif
#define TIMER_A1_BASE       TA1_BASE

#define TA1IV_TA1CCR1       TAIV__TACCR1
#define TA1IV_TA1CCR2       TAIV__TACCR2
#define TA1IV_TA1IFG        TAIV__TAIFG
#define TA1IV_NONE          TAIV__NONE
#define TA1IV_TACCR1        TAIV__TACCR1
#define TA1IV_TACCR2        TAIV__TACCR2
#define TA1IV_3             TAIV__TACCR3
#define TA1IV_4             TAIV__TACCR4
#define TA1IV_5             TAIV__TACCR5
#define TA1IV_6             TAIV__TACCR6
#define TA1IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA2__
#if (__MSP430_HAS_TA2__ == 2)
	#define __MSP430_BASEADDRESS_T2A2__ TA2_BASE
	#define __MSP430_HAS_T2A2__
#endif
#define TIMER_A2_BASE       TA2_BASE

#define TA2IV_TA2CCR1       TAIV__TACCR1
#define TA2IV_TA2IFG        TAIV__TAIFG
#define TA2IV_NONE          TAIV__NONE
#define TA2IV_TACCR1        TAIV__TACCR1
#define TA2IV_TACCR2        TAIV__TACCR2
#define TA2IV_3             TAIV__TACCR3
#define TA2IV_4             TAIV__TACCR4
#define TA2IV_5             TAIV__TACCR5
#define TA2IV_6             TAIV__TACCR6
#define TA2IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA3__
#if (__MSP430_HAS_TA3__ == 2)
	#define __MSP430_BASEADDRESS_T3A2__ TA3_BASE
	#define __MSP430_HAS_T3A2__
#endif
#define TIMER_A3_BASE       TA3_BASE

#define TA3IV_TA3CCR1       TAIV__TACCR1
#define TA3IV_TA3IFG        TAIV__TAIFG
#define TA3IV_NONE          TAIV__NONE
#define TA3IV_TACCR1        TAIV__TACCR1
#define TA3IV_TACCR2        TAIV__TACCR2
#define TA3IV_3             TAIV__TACCR3
#define TA3IV_4             TAIV__TACCR4
#define TA3IV_5             TAIV__TACCR5
#define TA3IV_6             TAIV__TACCR6
#define TA3IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA4__
#if (__MSP430_HAS_TA4__ == 3)
	#define __MSP430_BASEADDRESS_T4A3__ TA4_BASE
	#define __MSP430_HAS_T4A3__
#endif
#define TIMER_A4_BASE       TA4_BASE

#define TA4IV_TA4CCR1       TAIV__TACCR1
#define TA4IV_TA4IFG        TAIV__TAIFG
#define TA4IV_NONE          TAIV__NONE
#define TA4IV_TACCR1        TAIV__TACCR1
#define TA4IV_TACCR2        TAIV__TACCR2
#define TA4IV_3             TAIV__TACCR3
#define TA4IV_4             TAIV__TACCR4
#define TA4IV_5             TAIV__TACCR5
#define TA4IV_6             TAIV__TACCR6
#define TA4IV_TAIFG         TAIV__TAIFG
#endif

/************************************************************
* Timer B
************************************************************/

#ifdef __MSP430_HAS_TBx__
#define __MSP430_HAS_TxB7__

#define OFS_TBxCTL             OFS_TB0CTL
#define OFS_TBxCCTL0           OFS_TB0CCTL0
#define OFS_TBxCCTL1           OFS_TB0CCTL1
#define OFS_TBxCCTL2           OFS_TB0CCTL2
#define OFS_TBxCCTL3           OFS_TB0CCTL3
#define OFS_TBxCCTL4           OFS_TB0CCTL4
#define OFS_TBxCCTL5           OFS_TB0CCTL5
#define OFS_TBxCCTL6           OFS_TB0CCTL6
#define OFS_TBxR               OFS_TB0R
#define OFS_TBxCCR0            OFS_TB0CCR0
#define OFS_TBxCCR1            OFS_TB0CCR1
#define OFS_TBxCCR2            OFS_TB0CCR2
#define OFS_TBxCCR3            OFS_TB0CCR3
#define OFS_TBxCCR4            OFS_TB0CCR4
#define OFS_TBxCCR5            OFS_TB0CCR5
#define OFS_TBxCCR6            OFS_TB0CCR6
#define OFS_TBxIV              OFS_TB0IV
#define OFS_TBxEX0             OFS_TB0EX0

/* TBxIV Definitions */
#define TBxIV_NONE             (0x0000)       /* No Interrupt pending */
#define TBxIV_TBCCR1           (0x0002)       /* TBxCCR1_CCIFG */
#define TBxIV_TBCCR2           (0x0004)       /* TBxCCR2_CCIFG */
#define TBxIV_TBCCR3           (0x0006)       /* TBxCCR3_CCIFG */
#define TBxIV_TBCCR4           (0x0008)       /* TBxCCR4_CCIFG */
#define TBxIV_TBCCR5           (0x000A)       /* TBxCCR5_CCIFG */
#define TBxIV_TBCCR6           (0x000C)       /* TBxCCR6_CCIFG */
#define TBxIV_TBIFG            (0x000E)       /* TBxIFG */

/* Legacy Defines */
#define TBxIV_TBxCCR1          (0x0002)       /* TBxCCR1_CCIFG */
#define TBxIV_TBxCCR2          (0x0004)       /* TBxCCR2_CCIFG */
#define TBxIV_TBxCCR3          (0x0006)       /* TBxCCR3_CCIFG */
#define TBxIV_TBxCCR4          (0x0008)       /* TBxCCR4_CCIFG */
#define TBxIV_TBxCCR5          (0x000A)       /* TBxCCR5_CCIFG */
#define TBxIV_TBxCCR6          (0x000C)       /* TBxCCR6_CCIFG */
#define TBxIV_TBxIFG           (0x000E)       /* TBxIFG */

#ifndef MC__CONTINOUS
#define MC__CONTINOUS          MC__CONTINUOUS
#endif

#define SHR0                    TBCLGRP0
#define SHR1                    TBCLGRP1
#define SHR_0                   TBCLGRP_0
#define SHR_1                   TBCLGRP_1
#define SHR_2                   TBCLGRP_2
#define SHR_3                   TBCLGRP_3

#define SLSHR0                  CLLD0
#define SLSHR1                  CLLD1
#define SLSHR_0                 CLLD_0
#define SLSHR_1                 CLLD_1
#define SLSHR_2                 CLLD_2
#define SLSHR_3                 CLLD_3

#endif

#ifdef __MSP430_HAS_TB0__
#if (__MSP430_HAS_TB0__ == 3)
    #define __MSP430_BASEADDRESS_T0B3__ TB0_BASE
    #define __MSP430_HAS_T0B3__
#endif
#if (__MSP430_HAS_TB0__ == 7)
    #define __MSP430_BASEADDRESS_T0B7__ TB0_BASE
    #define __MSP430_HAS_T0B7__
#endif
#define TIMER_B0_BASE           TB0_BASE
#define TIMERB0_VECTOR          TIMER0_B0_VECTOR

#define TBCTL                   TB0CTL    /* Control Register */
#define TBCCTL0                 TB0CCTL0  /* Capture/Compare Control 0 */
#define TBCCTL1                 TB0CCTL1  /* Capture/Compare Control 1 */
#define TBCCTL2                 TB0CCTL2  /* Capture/Compare Control 2 */
#define TBCCTL3                 TB0CCTL3  /* Capture/Compare Control 3 */
#define TBCCTL4                 TB0CCTL4  /* Capture/Compare Control 4 */
#define TBCCTL5                 TB0CCTL5  /* Capture/Compare Control 5 */
#define TBCCTL6                 TB0CCTL6  /* Capture/Compare Control 6 */
#define TBR                     TB0R
#define TBCCR0                  TB0CCR0   /* Capture/Compare 0 */
#define TBCCR1                  TB0CCR1   /* Capture/Compare 1 */
#define TBCCR2                  TB0CCR2   /* Capture/Compare 2 */
#define TBCCR3                  TB0CCR3   /* Capture/Compare 3 */
#define TBCCR4                  TB0CCR4   /* Capture/Compare 4 */
#define TBCCR5                  TB0CCR5   /* Capture/Compare 5 */
#define TBCCR6                  TB0CCR6   /* Capture/Compare 6 */
#define TBEX0                   TB0EX0    /* Expansion Register 0 */

#define TBSSEL__TACLK           TBSSEL__TBCLK
    
#define TB0IV_NONE              TBIV__NONE
#define TB0IV_TB0CCR1           TBIV__TBCCR1
#define TB0IV_TB0CCR2           TBIV__TBCCR2
#define TB0IV_TB0CCR3           TBIV__TBCCR3
#define TB0IV_TB0CCR4           TBIV__TBCCR4
#define TB0IV_TB0CCR5           TBIV__TBCCR5
#define TB0IV_TB0CCR6           TBIV__TBCCR6
#define TB0IV_TB0IFG            TBIV__TBIFG

#define TB0IV_TBCCR1            TBIV__TBCCR1
#define TB0IV_TBCCR2            TBIV__TBCCR2
#define TB0IV_TBCCR3            TBIV__TBCCR3
#define TB0IV_TBCCR4            TBIV__TBCCR4
#define TB0IV_TBCCR5            TBIV__TBCCR5
#define TB0IV_TBCCR6            TBIV__TBCCR6
#define TB0IV_TBIFG             TBIV__TBIFG

#endif

#ifdef __MSP430_HAS_TB1__
#if (__MSP430_HAS_TB1__ == 3)
    #define __MSP430_HAS_T1B3__
    #define __MSP430_BASEADDRESS_T1B3__ TB1_BASE
#endif
#define TIMER_B1_BASE           TB1_BASE
#define TIMERB1_VECTOR          TIMER0_B1_VECTOR

#define TB1IV_NONE              TBIV__NONE
#define TB1IV_TB1CCR1           TBIV__TBCCR1
#define TB1IV_TB1CCR2           TBIV__TBCCR2
#define TB1IV_TB1IFG            TBIV__TBIFG
#define TB1IV_TBCCR1            TBIV__TBCCR1
#define TB1IV_TBCCR2            TBIV__TBCCR2
#define TB1IV_TBIFG             TBIV__TBIFG

#endif

/************************************************************
* USCI
************************************************************/

#if defined(__MSP430_HAS_EUSCI_Ax__) || defined(__MSP430_HAS_EUSCI_Bx__)

