pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#ifdef __MSP430_HAS_EUSCI_A0__
#define USCI_A0_VECTOR          EUSCI_A0_VECTOR

#define UCA0CTL1                UCA0CTLW0_L    /* USCI A0 Control Register 1 */
#define UCA0CTL0                UCA0CTLW0_H    /* USCI A0 Control Register 0 */
#define UCA0BR0                 UCA0BRW_L      /* USCI A0 Baud Rate 0 */
#define UCA0BR1                 UCA0BRW_H      /* USCI A0 Baud Rate 1 */
#define UCA0IRTCTL              UCA0IRCTL_L    /* USCI A0 IrDA Transmit Control */
#define UCA0IRRCTL              UCA0IRCTL_H    /* USCI A0 IrDA Receive Control */

#endif

#ifdef __MSP430_HAS_EUSCI_A1__
#define USCI_A1_VECTOR          EUSCI_A1_VECTOR

#define UCA1CTL1                UCA1CTLW0_L    /* USCI A1 Control Register 1 */
#define UCA1CTL0                UCA1CTLW0_H    /* USCI A1 Control Register 0 */
#define UCA1BR0                 UCA1BRW_L      /* USCI A1 Baud Rate 0 */
#define UCA1BR1                 UCA1BRW_H      /* USCI A1 Baud Rate 1 */
#define UCA1IRTCTL              UCA1IRCTL_L    /* USCI A1 IrDA Transmit Control */
#define UCA1IRRCTL              UCA1IRCTL_H    /* USCI A1 IrDA Receive Control */

#endif

#ifdef __MSP430_HAS_EUSCI_A2__
#define USCI_A2_VECTOR          EUSCI_A2_VECTOR

#define UCA2CTL1                UCA2CTLW0_L    /* USCI A2 Control Register 1 */
#define UCA2CTL0                UCA2CTLW0_H    /* USCI A2 Control Register 0 */
#define UCA2BR0                 UCA2BRW_L      /* USCI A2 Baud Rate 0 */
#define UCA2BR1                 UCA2BRW_H      /* USCI A2 Baud Rate 1 */
#define UCA2IRTCTL              UCA2IRCTL_L    /* USCI A2 IrDA Transmit Control */
#define UCA2IRRCTL              UCA2IRCTL_H    /* USCI A2 IrDA Receive Control */

#endif

#ifdef __MSP430_HAS_EUSCI_A3__
#define USCI_A3_VECTOR          EUSCI_A3_VECTOR

#define UCA3CTL1                UCA3CTLW0_L    /* USCI A3 Control Register 1 */
#define UCA3CTL0                UCA3CTLW0_H    /* USCI A3 Control Register 0 */
#define UCA3BR0                 UCA3BRW_L      /* USCI A3 Baud Rate 0 */
#define UCA3BR1                 UCA3BRW_H      /* USCI A3 Baud Rate 1 */
#define UCA3IRTCTL              UCA3IRCTL_L    /* USCI A3 IrDA Transmit Control */
#define UCA3IRRCTL              UCA3IRCTL_H    /* USCI A3 IrDA Receive Control */

#endif

#endif

/************************************************************
* USCI Bx
************************************************************/

#ifdef  __MSP430_HAS_EUSCI_Bx__       /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_Bx__

#define UCBxCTL1               UCB0CTLW0_L
#define UCBxCTL0               UCB0CTLW0_H
#define UCBxBR0                UCB0BRW_L
#define UCBxBR1                UCB0BRW_H
#define UCBxSTAT               UCB0STATW_L
#define UCBxBCNT               UCB0STATW_H

#define OFS_UCBxCTLW0__SPI     (0x0000)
#define OFS_UCBxCTLW0__SPI_L   OFS_UCBxCTLW0__SPI
#define OFS_UCBxCTLW0__SPI_H   OFS_UCBxCTLW0__SPI+1
#define OFS_UCBxCTL0__SPI      (0x0001)
#define OFS_UCBxCTL1__SPI      (0x0000)
#define OFS_UCBxBRW__SPI       (0x0006)
#define OFS_UCBxBRW__SPI_L     OFS_UCBxBRW__SPI
#define OFS_UCBxBRW__SPI_H     OFS_UCBxBRW__SPI+1
#define OFS_UCBxBR0__SPI       (0x0006)
#define OFS_UCBxBR1__SPI       (0x0007)
#define OFS_UCBxSTATW__SPI     (0x0008)
#define OFS_UCBxSTATW__SPI_L   OFS_UCBxSTATW__SPI
#define OFS_UCBxSTATW__SPI_H   OFS_UCBxSTATW__SPI+1
#define OFS_UCBxRXBUF__SPI     (0x000C)
#define OFS_UCBxRXBUF__SPI_L   OFS_UCBxRXBUF__SPI
#define OFS_UCBxRXBUF__SPI_H   OFS_UCBxRXBUF__SPI+1
#define OFS_UCBxTXBUF__SPI     (0x000E)
#define OFS_UCBxTXBUF__SPI_L   OFS_UCBxTXBUF__SPI
#define OFS_UCBxTXBUF__SPI_H   OFS_UCBxTXBUF__SPI+1
#define OFS_UCBxIE__SPI        (0x002A)
#define OFS_UCBxIE__SPI_L      OFS_UCBxIE__SPI
#define OFS_UCBxIE__SPI_H      OFS_UCBxIE__SPI+1
#define OFS_UCBxIFG__SPI       (0x002C)
#define OFS_UCBxIFG__SPI_L     OFS_UCBxIFG__SPI
#define OFS_UCBxIFG__SPI_H     OFS_UCBxIFG__SPI+1
#define OFS_UCBxIV__SPI        (0x002E)

#define OFS_UCBxCTLW0          (0x0000)       /* USCI Bx Control Word Register 0 */
#define OFS_UCBxCTLW0_L        OFS_UCBxCTLW0
#define OFS_UCBxCTLW0_H        OFS_UCBxCTLW0+1
#define OFS_UCBxCTL0           (0x0001)
#define OFS_UCBxCTL1           (0x0000)
#define OFS_UCBxCTLW1          (0x0002)       /* USCI Bx Control Word Register 1 */
#define OFS_UCBxCTLW1_L        OFS_UCBxCTLW1
#define OFS_UCBxCTLW1_H        OFS_UCBxCTLW1+1
#define OFS_UCBxBRW            (0x0006)       /* USCI Bx Baud Word Rate 0 */
#define OFS_UCBxBRW_L          OFS_UCBxBRW
#define OFS_UCBxBRW_H          OFS_UCBxBRW+1
#define OFS_UCBxBR0            (0x0006)
#define OFS_UCBxBR1            (0x0007)
#define OFS_UCBxSTATW          (0x0008)       /* USCI Bx Status Word Register */
#define OFS_UCBxSTATW_L        OFS_UCBxSTATW
#define OFS_UCBxSTATW_H        OFS_UCBxSTATW+1
#define OFS_UCBxSTATW__I2C     (0x0008)
#define OFS_UCBxSTAT__I2C      (0x0008)
#define OFS_UCBxBCNT__I2C      (0x0009)
#define OFS_UCBxTBCNT          (0x000A)       /* USCI Bx Byte Counter Threshold Register */
#define OFS_UCBxTBCNT_L        OFS_UCBxTBCNT
#define OFS_UCBxTBCNT_H        OFS_UCBxTBCNT+1
#define OFS_UCBxRXBUF          (0x000C)       /* USCI Bx Receive Buffer */
#define OFS_UCBxRXBUF_L        OFS_UCBxRXBUF
#define OFS_UCBxRXBUF_H        OFS_UCBxRXBUF+1
#define OFS_UCBxTXBUF          (0x000E)       /* USCI Bx Transmit Buffer */
#define OFS_UCBxTXBUF_L        OFS_UCBxTXBUF
#define OFS_UCBxTXBUF_H        OFS_UCBxTXBUF+1
#define OFS_UCBxI2COA0         (0x0014)       /* USCI Bx I2C Own Address 0 */
#define OFS_UCBxI2COA0_L       OFS_UCBxI2COA0
#define OFS_UCBxI2COA0_H       OFS_UCBxI2COA0+1
#define OFS_UCBxI2COA1         (0x0016)       /* USCI Bx I2C Own Address 1 */
#define OFS_UCBxI2COA1_L       OFS_UCBxI2COA1
#define OFS_UCBxI2COA1_H       OFS_UCBxI2COA1+1
#define OFS_UCBxI2COA2         (0x0018)       /* USCI Bx I2C Own Address 2 */
#define OFS_UCBxI2COA2_L       OFS_UCBxI2COA2
#define OFS_UCBxI2COA2_H       OFS_UCBxI2COA2+1
#define OFS_UCBxI2COA3         (0x001A)       /* USCI Bx I2C Own Address 3 */
#define OFS_UCBxI2COA3_L       OFS_UCBxI2COA3
#define OFS_UCBxI2COA3_H       OFS_UCBxI2COA3+1
#define OFS_UCBxADDRX          (0x001C)       /* USCI Bx Received Address Register */
#define OFS_UCBxADDRX_L        OFS_UCBxADDRX
#define OFS_UCBxADDRX_H        OFS_UCBxADDRX+1
#define OFS_UCBxADDMASK        (0x001E)       /* USCI Bx Address Mask Register */
#define OFS_UCBxADDMASK_L      OFS_UCBxADDMASK
#define OFS_UCBxADDMASK_H      OFS_UCBxADDMASK+1
#define OFS_UCBxI2CSA          (0x0020)       /* USCI Bx I2C Slave Address */
#define OFS_UCBxI2CSA_L        OFS_UCBxI2CSA
#define OFS_UCBxI2CSA_H        OFS_UCBxI2CSA+1
#define OFS_UCBxIE             (0x002A)       /* USCI Bx Interrupt Enable Register */
#define OFS_UCBxIE_L           OFS_UCBxIE
#define OFS_UCBxIE_H           OFS_UCBxIE+1
#define OFS_UCBxIFG            (0x002C)       /* USCI Bx Interrupt Flags Register */
#define OFS_UCBxIFG_L          OFS_UCBxIFG
#define OFS_UCBxIFG_H          OFS_UCBxIFG+1
#define OFS_UCBxIE__I2C        (0x002A)
#define OFS_UCBxIE__I2C_L      OFS_UCBxIE__I2C
#define OFS_UCBxIE__I2C_H      OFS_UCBxIE__I2C+1
#define OFS_UCBxIFG__I2C       (0x002C)
#define OFS_UCBxIFG__I2C_L     OFS_UCBxIFG__I2C
#define OFS_UCBxIFG__I2C_H     OFS_UCBxIFG__I2C+1
#define OFS_UCBxIV             (0x002E)       /* USCI Bx Interrupt Vector Register */

#ifndef UCASTP_3
#define UCASTP_3                UCASTP
#endif

#ifdef __MSP430_HAS_EUSCI_B0__
#define USCI_B0_VECTOR          EUSCI_B0_VECTOR

#define UCB0CTL1                UCB0CTLW0_L    /* USCI B0 Control Register 1 */
#define UCB0CTL0                UCB0CTLW0_H    /* USCI B0 Control Register 0 */
#define UCB0BR0                 UCB0BRW_L      /* USCI B0 Baud Rate 0 */
#define UCB0BR1                 UCB0BRW_H      /* USCI B0 Baud Rate 1 */
#define UCB0STAT                UCB0STATW_L    /* USCI B0 Status Register */
#define UCB0BCNT                UCB0STATW_H    /* USCI B0 Byte Counter Register */

#endif

#ifdef __MSP430_HAS_EUSCI_B1__
#define USCI_B1_VECTOR          EUSCI_B1_VECTOR

#define UCB1CTL1                UCB1CTLW0_L    /* USCI B1 Control Register 1 */
#define UCB1CTL0                UCB1CTLW0_H    /* USCI B1 Control Register 0 */
#define UCB1BR0                 UCB1BRW_L      /* USCI B1 Baud Rate 0 */
#define UCB1BR1                 UCB1BRW_H      /* USCI B1 Baud Rate 1 */
#define UCB1STAT                UCB1STATW_L    /* USCI B1 Status Register */
#define UCB1BCNT                UCB1STATW_H    /* USCI B1 Byte Counter Register */

#endif

