pftbest/msp430_svd/msp430-gcc-support-files/include/legacy.h
#ifdef __MSP430_HAS_EUSCI_B2__
#define USCI_B2_VECTOR          EUSCI_B2_VECTOR

#define UCB2CTL1                UCB2CTLW0_L    /* USCI B2 Control Register 1 */
#define UCB2CTL0                UCB2CTLW0_H    /* USCI B2 Control Register 0 */
#define UCB2BR0                 UCB2BRW_L      /* USCI B2 Baud Rate 0 */
#define UCB2BR1                 UCB2BRW_H      /* USCI B2 Baud Rate 1 */
#define UCB2STAT                UCB2STATW_L    /* USCI B2 Status Register */
#define UCB2BCNT                UCB2STATW_H    /* USCI B2 Byte Counter Register */

#endif

#ifdef __MSP430_HAS_EUSCI_B3__
#define USCI_B3_VECTOR          EUSCI_B3_VECTOR

#define UCB3CTL1                UCB3CTLW0_L    /* USCI B3 Control Register 1 */
#define UCB3CTL0                UCB3CTLW0_H    /* USCI B3 Control Register 0 */
#define UCB3BR0                 UCB3BRW_L      /* USCI B3 Baud Rate 0 */
#define UCB3BR1                 UCB3BRW_H      /* USCI B3 Baud Rate 1 */
#define UCB3STAT                UCB3STATW_L    /* USCI B3 Status Register */
#define UCB3BCNT                UCB3STATW_H    /* USCI B3 Byte Counter Register */

#endif

#endif

/************************************************************
* WDT
************************************************************/

#ifdef __MSP430_HAS_WDT_A__       /* Definition to show that Module is available */

/* WDT-interval times [1ms] coded with Bits 0-2 */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MDLY_32             (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2)                         /* 32ms interval (default) */
#define WDT_MDLY_8              (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS0)                  /* 8ms     " */
#define WDT_MDLY_0_5            (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS1)                  /* 0.5ms   " */
#define WDT_MDLY_0_064          (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS1+WDTIS0)           /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ADLY_1000           (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0)                /* 1000ms  " */
#define WDT_ADLY_250            (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS0)         /* 250ms   " */
#define WDT_ADLY_16             (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS1)         /* 16ms    " */
#define WDT_ADLY_1_9            (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS1+WDTIS0)  /* 1.9ms   " */
/* Watchdog mode -> reset after expired time */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MRST_32             (WDTPW+WDTCNTCL+WDTIS2)                                  /* 32ms interval (default) */
#define WDT_MRST_8              (WDTPW+WDTCNTCL+WDTIS2+WDTIS0)                           /* 8ms     " */
#define WDT_MRST_0_5            (WDTPW+WDTCNTCL+WDTIS2+WDTIS1)                           /* 0.5ms   " */
#define WDT_MRST_0_064          (WDTPW+WDTCNTCL+WDTIS2+WDTIS1+WDTIS0)                    /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ARST_1000           (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2)                         /* 1000ms  " */
#define WDT_ARST_250            (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS0)                  /* 250ms   " */
#define WDT_ARST_16             (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS1)                  /* 16ms    " */
#define WDT_ARST_1_9            (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS1+WDTIS0)           /* 1.9ms   " */

#define WDTSSEL__VLO            WDTSSEL__VLOCLK

#endif
